# YOLOv5_Pico_5D

# Parameters
nc: 11  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 0.25  # layer channel multiple
anchors: 
  - [19,22,  54,36,  32,77]  # P3/8
  - [70,83,  138,71,  75,173]  # P4/16
  - [165,159,  148,334,  375,151]  # P5/32
  - [334,317,  251,626,  499,474]  # P6/64
  - [750,326,  534,814,  1079,818]  # P7/128

# YOLOv5_Pico_5D backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [16, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [32, 3, 2]],  # 1-P2/4
   [-1, 1, C3, [32]],
   [-1, 1, Conv, [64, 3, 2]],  # 3-P3/8
   [-1, 1, C3, [64]],
   [-1, 1, Conv, [128, 3, 2]],  # 5-P4/16
   [-1, 1, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 7-P5/32
   [-1, 1, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 9-P6/64
   [-1, 1, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 11-P7/128
   [-1, 1, C3, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 13
  ]

# YOLOv5_Pico_5D head with 5 outputs
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 10], 1, Concat, [1]],  # cat backbone P6
   [-1, 1, C3, [512, False]],  # 17

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 8], 1, Concat, [1]],  # cat backbone P5
   [-1, 1, C3, [256, False]],  # 21

   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 1, C3, [128, False]],  # 25

   [-1, 1, Conv, [64, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 1, C3, [64, False]],  # 29 (P3/8-small)

   [-1, 1, Conv, [64, 3, 2]],
   [[-1, 26], 1, Concat, [1]],  # cat head P4
   [[-1, 5], 1, AddSum,[1]],
   [-1, 1, C3, [128, False]],  # 32 (P4/16-medium)

   [-1, 1, Conv, [128, 3, 2]],
   [[-1, 22], 1, Concat, [1]],  # cat head P5
   [[-1, 7], 1, AddSum,[1]],
   [-1, 1, C3, [256, False]],  # 35 (P5/32-large)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 18], 1, Concat, [1]],  # cat head P6
   [[-1, 9], 1, AddSum,[1]],
   [-1, 1, C3, [512, False]],  # 38 (P6/64-xlarge)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 14], 1, Concat, [1]],  # cat head P7
   [[-1, 11], 1, AddSum,[1]],
   [-1, 1, C3, [1024, False]],  # 41 (P7/128-xxlarge)

   [[29, 33, 37, 41, 45], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5, P6, P7)
  ]
 
  